[
  { "ques": "What is the capital of France?" },
  { "ques": "What is the speed of light?" },
  { "ques": "What is the difference between a virus and a bacterium?" },
  { "ques": "What is the definition of love?" },
  { "ques": "What is the boiling point of water?" },
  { "ques": "Write me a code in Java for calculating the area of a circle." },
  {
    "ques": "Write me a code in Java for generating a random number between 1 and 100."
  },
  { "ques": "Write me a code in Java for converting a string to an integer." },
  {
    "ques": "Write me a code in Java for checking if a given number is prime or not."
  },
  {
    "ques": "Write me a code in Java for finding the factorial of a given number."
  },
  {
    "ques": "Write me a code in Java for sorting an array in ascending order."
  },
  {
    "ques": "Write me a code in Java for finding the maximum value in an array."
  },
  { "ques": "Write me a code in Java for reversing a string." },
  {
    "ques": "Write me a code in Java for checking if a string is a palindrome or not."
  },
  { "ques": "Write me a code in Java for calculating the sum of two numbers." },
  {
    "ques": "Write me a code in Java for calculating the difference between two numbers."
  },
  {
    "ques": "Write me a code in Java for calculating the product of two numbers."
  },
  {
    "ques": "Write me a code in Java for calculating the quotient of two numbers."
  },
  {
    "ques": "Write me a code in Java for finding the square root of a number."
  },
  { "ques": "Write me a code in Java for finding the power of a number." },
  {
    "ques": "Write me a code in Java for checking if a number is even or odd."
  },
  {
    "ques": "Write me a code in Java for checking if a year is a leap year or not."
  },
  {
    "ques": "Write me a code in Java for calculating the factorial of a number using recursion."
  },
  { "ques": "Write me a code in Java for finding the nth Fibonacci number." },
  {
    "ques": "Write me a code in Java for checking if a string is a valid palindrome or not."
  },
  {
    "ques": "Write me a code in Java for finding the sum of all elements in an array."
  },
  {
    "ques": "Write me a code in Java for finding the average value of an array."
  },
  {
    "ques": "Write me a code in Java for converting a decimal number to binary."
  },
  {
    "ques": "Write me a code in Java for finding the GCD of two numbers using recursion."
  },
  {
    "ques": "Write me a code in Java for checking if a given string is a valid email address or not."
  },
  {
    "ques": "Write me a code in Java for checking if a given number is a perfect square or not."
  },
  {
    "ques": "Write me a code in Java for checking if a given string is a palindrome or not, ignoring case."
  },
  {
    "ques": "Write me a code in Java for calculating the sum of all even numbers between 1 and 100."
  },
  {
    "ques": "Write me a code in Java for calculating the sum of all odd numbers between 1 and 100."
  },

  { "ques": "What is the function of the liver?" },
  { "ques": "What is the difference between a hurricane and a tornado?" },
  { "ques": "What is the meaning of the word conundrum?" },
  { "ques": "What is the circumference of a circle?" },
  { "ques": "What is the atomic number of carbon?" },
  { "ques": "What is the largest organ in the human body?" },
  { "ques": "What is the difference between a democracy and a dictatorship?" },
  { "ques": "What is the formula for calculating density?" },
  { "ques": "What is the capital of Australia?" },
  { "ques": "What is the meaning of the word facetious?" },
  { "ques": "What is the difference between a mammal and a reptile?" },
  { "ques": "What is the height of Mount Everest?" },
  { "ques": "What is the difference between a kilogram and a pound?" },
  { "ques": "What is the pH of pure water?" },
  { "ques": "What is the meaning of the word onomatopoeia?" },
  { "ques": "What is the difference between a spider and an insect?" },
  { "ques": "What is the melting point of iron?" },
  { "ques": "What is the difference between an acid and a base?" },
  { "ques": "What is the capital of Canada?" },
  { "ques": "What is the difference between a planet and a star?" },
  { "ques": "What is the circumference of the Earth?" },
  {
    "ques": "What is the difference between a biography and an autobiography?"
  },
  { "ques": "What is the boiling point of ethanol?" },
  {
    "ques": "What is the difference between a vertebrate and an invertebrate?"
  },
  { "ques": "What is the chemical symbol for gold?" },
  { "ques": "What is the difference between a convex and a concave lens?" },
  { "ques": "What is the meaning of the word serendipity?" },
  { "ques": "What is the difference between a genotype and a phenotype?" },
  { "ques": "What is the boiling point of mercury?" },
  { "ques": "What is the difference between a neuron and a glial cell?" },
  { "ques": "What is the capital of Mexico?" },
  { "ques": "What is the difference between a cation and an anion?" },
  { "ques": "What is the largest planet in the solar system?" }
]
